tutorials/multiphase/settlingFoam/dahl/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.1)
    (8.65 0 -0.1)
    (8.65 0.1 -0.1)
    (0 0.1 -0.1)
    (8.65 1 -0.1)
    (0 1 -0.1)
    (0 0 0.1)
    (8.65 0 0.1)
    (8.65 0.1 0.1)
    (0 0.1 0.1)
    (8.65 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 6 7 8 9) (200 4 1) simpleGrading (1 1 1)
    hex (3 2 4 5 9 8 10 11) (200 36 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 6 9 3)
        (3 9 11 5)
    )
    patch outlet
    (
        (1 2 8 7)
    )
    patch bottomWall
    (
        (0 1 7 6)
    )
    wall endWall
    (
        (2 4 10 8)
    )
    symmetryPlane top
    (
        (5 11 10 4)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (6 7 8 9)
        (3 5 4 2)
        (9 8 10 11)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
