tutorials/multiphase/settlingFoam/dahl/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
inlet
{
    type patch;
    nFaces 40;
    startFace 15760;
}

outlet
{
    type patch;
    nFaces 4;
    startFace 15800;
}

bottomWall
{
    type patch;
    nFaces 200;
    startFace 15804;
}

endWall
{
    type wall;
    nFaces 36;
    startFace 16004;
}

top
{
    type symmetryPlane;
    nFaces 200;
    startFace 16040;
}

frontAndBack
{
    type empty;
    nFaces 16000;
    startFace 16240;
}
)

// ************************************************************************* //
